[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@현재 케이스 순차 번호. 각 케이스에 대해 $CASENUM은 해당 케이스를 포함하여 읽은 케이스 수입니다. 형식은 F8.0입니다. $CASENUM의 값은 데이터 편집기 창에서 반드시 행 번호가 아니며(창 환경으로 제공) 파일을 정렬하거나 파일 끝 이전에 새 케이스를 삽입할 경우 값이 변경됩니다.
$sysmis10=10@$Sysmis@$SYSMIS@시스템 결측값. 시스템 결측값은 마침표(.)로 표시되거나 소수점이하자리 표시자로 사용됩니다.
$date4=4@$Date@$DATE@2자리 연도의 국제 날짜 형식인 현재 날짜. 형식은 dd-mmm-yy의 A9입니다.
$jdate4=4@$JDate@$JDATE@1582년 10월 14일 이후 현재 날짜(일수)(그레고리오 달력의 1일). 형식은 F6.0입니다.
$date114=4@$Date11@$DATE11@4자리 연도의 국제 날짜 형식인 현재 날짜. 형식은 dd-mmm-yyyy의 A11입니다.
$time4=4@$Time@$TIME@현재 날짜 및 시간. $TIME은 1582년 10월 14일을 기준으로 이 변수를 사용하는 변환 명령문이 실행되는 시점의 날짜 및 시간까지의 초 수를 나타냅니다. 형식은 F20입니다. 다양한 날짜 형식으로 이 날짜를 표시할 수 있습니다. 또한 날짜 및 시간 함수로 사용할 수 있습니다.
abs1=1@Abs@ABS(?)@ABS(숫자표현식) 숫자. 숫자표현식 절대값을 반환하며 숫자이어야 합니다.
any13=13@Any@ANY(?,?)@ANY(test,값[,값,...]). 논리 형식. 검정값이 후속 값에 일치할 때 1 또는 참을 반환하고 그렇지 않을 때는 0 또는 거짓을 반환합니다. 이 함수는 둘 이상의 인수를 사용합니다. 예를 들어 ANY(var1, 1, 3, 5)는 var1의 값이 다른 값에 대해 1, 3 또는 5인 경우 1을 반환합니다. 또한 ANY를 사용하여 특정 값에 대한 변수 또는 표현식 목록을 검색할 수 있습니다. 예를 들어 ANY(1, var1, var2, var3)는 세 개의 지정된 변수가 1 값을 가질 경우 1을 반환하고 세 개의 모든 변수가 1 이외의 값을 가질 경우 0을 반환합니다.
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(핸들, "함수", 값). 숫자. 핸들이 지정하는 모형을 사용하여 특정 점수 함수를 입력 케이스 데이터에 적용하며, 여기서의 “function”은 predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance와 같은 문자열 리터럴 값 중 하나로 따옴표로 묶여 표시됩니다. 모드 핸들은 MODEL HANDLE 명령에서 정의된 것처럼 외부 XML 파일과 연결된 이름입니다. 세 개의 선택적 인수는 함수가 "probability", "neighbor" 또는 "distance"일 때 적용됩니다. "probability"는 확률이 계산되는 범주를 지정합니다. "neighbor" 및 "distance"는 가장 가까운 이웃 모형에 대한 특정 이웃(정수)을 지정합니다. 값이 계산될 수 없는 경우에 ApplyModel은 시스템 결측값을 반환합니다.
arsin1=1@Arsin@ARSIN(?)@ARSIN(숫자표현식) 숫자. 숫자표현식 코시컨트(arcsine)를 라디안 값으로 반환하며 -1부터 +1까지의 숫자 값으로 추정되어야 합니다.
artan1=1@Artan@ARTAN(?)@ARTAN(숫자표현식). 숫자. 숫자표현식 코탄젠트(arctangent)를 라디안 값으로 반환하며 숫자이어야 합니다.
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(양, 확률) 숫자. 확률 모수를 사용하여 Bernoulli 분포의 값이 양보다 작거나 같은 누적 확률을 반환합니다.
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(양, 형태1, 형태2) 숫자. 형태 모수를 사용하여 베타 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(양, n, 확률) 숫자. 각 시도에서 성공할 확률인 확률 모수를 사용하여 n회의 시도에서 성공한 수가 양보다 작거나 같은 누적 확률을 반환합니다. n이 1이면 이 값은 CDF.BERNOULLI와 같습니다.
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(양1, 양2, 상관) 숫자. 상관 모수를 사용하여 표준 이변량 정규분포의 값이 양1과 양2보다 작은 누적 확률을 반환합니다.
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(양, 위치, 척도) 숫자. 위치와 척도 모수를 사용하여 Cauchy 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(양, 자유도) 숫자. 자유도 df를 사용하여 카이제곱 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(양, 척도) 숫자. 척도 모수를 사용하여 지수 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(양, 자유도1, 자유도2) 숫자. 자유도 df1과 df2를 사용하여 F 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(양, 형태, 척도) 숫자. 형태와 척도 모수를 사용하여 감마 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(양, 확률) 숫자. 성공 확률이 확률에 의해 얻어질 때 성공을 시도한 수가 양보다 작거나 같은 누적 확률을 반환합니다.
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(양, 평균, 표준편차) 숫자. 지정한 평균과 표준편차 모수를 사용하여 반정규분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(양, 전체수, 실패수, 추출수) 숫자. hits가 지정한 특성을 갖는 크기 total로부터 표본 개체를 임의로 선택할 때 지정한 특성을 갖는 개체 수가 양보다 작거나 같은 누적 확률을 반환합니다.
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(양, 위치, 척도) 숫자. 위치와 척도 모수를 사용하여 역 Gaussian 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(양, 평균, 척도) 숫자. 평균과 척도 모수를 사용하여 라플라스 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(양, a, b) 숫자. 지정한 모수를 사용하여 로그-정규분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(양, 평균, 척도) 숫자. 지정한 평균과 척도 모수를 사용하여 로지스틱 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(양, 한계치, 확률) 숫자. 한계치 모수가 한계치이고 성공 확률이 확률에 의해 얻어질 때 성공을 시도한 수가 양보다 작거나 같은 누적 확률을 반환합니다.
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(양, 평균, 표준편차) 숫자. 지정한 평균과 표준편차 모수를 사용하여 정규분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(양, 한계치, 형태) 숫자. 지정한 한계치와 형태 모수를 사용하여 파레토 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(양, 평균) 숫자. 지정한 평균 또는 비율 모수를 사용하여 포아송 분포의 값이 양보다 작거나 같은 누적 확률을 반환합니다.
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(양, a, b) 숫자. 지정한 모수를 사용하여 스튜던트화 최대 계수의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(양, a, b) 숫자. 지정한 모수를 사용하여 스튜던트화 범위 통계량의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(양, 자유도) 숫자. 지정한 자유도 df를 사용하여 스튜던트 t 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(양, 최소값, 최대값) 숫자. 지정한 최소값과 최대값을 사용하여 균일분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(양, a, b) 숫자. 지정한 모수를 사용하여 와이블 분포의 값이 양보다 작은 누적 확률을 반환합니다.
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(z값) 숫자. 평균 0과 표준편차 1인 확률변수가 z값보다 작은 확률을 반환하며 숫자이어야 합니다.
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(숫자표현식,숫자표현식[,...]) 숫자. 유효값을 가진 인수의 변동 계수(표준편차를 평균으로 나눈 값)를 반환합니다. 이 함수는 둘 이상의 인수를 사용하며 모두 숫자이어야 합니다. 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor]) 숫자. haystack에서 needle의 첫 번째 발생 문자 위치를 가리키는 숫자를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 하위 문자를 각각 검색하여 그 중 첫 번째 발생값을 반환합니다. 예를 들어 CHAR.INDEX(var1, 'abcd')는 문자 변수 var1에서 전체 문자 "abcd"의 시작 위치 값을 반환하고 CHAR.INDEX(var1, 'abcd', 1)는 문자에서 값의 첫 번째 발생 위치 값을 반환하며 CHAR.INDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 첫 번째 발생 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle이 haystack 내에서 발생되지 않을 때는 0을 반환합니다.
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor]) 숫자. haystack에서 needle의 첫 번째 발생 문자 위치를 가리키는 숫자를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 하위 문자를 각각 검색하여 그 중 첫 번째 발생값을 반환합니다. 예를 들어 CHAR.INDEX(var1, 'abcd')는 문자 변수 var1에서 전체 문자 "abcd"의 시작 위치 값을 반환하고 CHAR.INDEX(var1, 'abcd', 1)는 문자에서 값의 첫 번째 발생 위치 값을 반환하며 CHAR.INDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 첫 번째 발생 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle이 haystack 내에서 발생되지 않을 때는 0을 반환합니다.
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor]) 숫자. haystack에서 needle의 첫 번째 발생 문자 위치를 가리키는 숫자를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 하위 문자를 각각 검색하여 그 중 첫 번째 발생값을 반환합니다. 예를 들어 CHAR.INDEX(var1, 'abcd')는 문자 변수 var1에서 전체 문자 "abcd"의 시작 위치 값을 반환하고 CHAR.INDEX(var1, 'abcd', 1)는 문자에서 값의 첫 번째 발생 위치 값을 반환하며 CHAR.INDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 첫 번째 발생 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle이 haystack 내에서 발생되지 않을 때는 0을 반환합니다.
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor]) 숫자. haystack에서 needle의 첫 번째 발생 문자 위치를 가리키는 숫자를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 하위 문자를 각각 검색하여 그 중 첫 번째 발생값을 반환합니다. 예를 들어 CHAR.INDEX(var1, 'abcd')는 문자 변수 var1에서 전체 문자 "abcd"의 시작 위치 값을 반환하고 CHAR.INDEX(var1, 'abcd', 1)는 문자에서 값의 첫 번째 발생 위치 값을 반환하며 CHAR.INDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 첫 번째 발생 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle이 haystack 내에서 발생되지 않을 때는 0을 반환합니다.
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(문자표현식) 숫자. 문자표현식의 길이를 뒤에 오는 공백이 제거된 상태에서 문자로 반환합니다.
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(문자표현식1,길이[,문자표현식2]) 문자열. 문자표현식2에 채우기 문자로 사용할 전체 복사본 수만큼 사용하여 길이에 의해 지정된 값으로 길이를 만들 왼쪽 채우기 문자표현식1입니다. 길이 값은 문자 수를 나타내며 양의 정수이어야 합니다. 선택적인 인수 문자표현식2가 생략될 경우 값은 공백으로 채워집니다.
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(문자표현식1,길이[,문자표현식2]) 문자열. 문자표현식2에 채우기 문자로 사용할 전체 복사본 수만큼 사용하여 길이에 의해 지정된 값으로 길이를 만들 왼쪽 채우기 문자표현식1입니다. 길이 값은 문자 수를 나타내며 양의 정수이어야 합니다. 선택적인 인수 문자표현식2가 생략될 경우 값은 공백으로 채워집니다.
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(문자표현식,위치) 숫자. 문자표현식의 문자 위치에서 문자로 바이트 수를 반환합니다.
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor]) 숫자. haystack이라는 문자에서 문자 needle의 첫번째 발생 시작 문자 위치를 가리키는 정수를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 예를 들어 CHAR.RINDEX(var1, 'abcd')는 변수 var1에서 전체 문자 "abcd"의 마지막 발생에 대한 시작 위치를 반환하고 CHAR.RINDEX(var1, 'abcd', 1)는 문자에서 값의 마지막 발생 위치 값을 반환하며 CHAR.RINDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 마지막 발생의 시작 위치 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle을 찾을 수 없는 경우 값 0이 반환됩니다.
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor]) 숫자. haystack이라는 문자에서 문자 needle의 첫번째 발생 시작 문자 위치를 가리키는 정수를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 예를 들어 CHAR.RINDEX(var1, 'abcd')는 변수 var1에서 전체 문자 "abcd"의 마지막 발생에 대한 시작 위치를 반환하고 CHAR.RINDEX(var1, 'abcd', 1)는 문자에서 값의 마지막 발생 위치 값을 반환하며 CHAR.RINDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 마지막 발생의 시작 위치 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle을 찾을 수 없는 경우 값 0이 반환됩니다.
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor]) 숫자. haystack이라는 문자에서 문자 needle의 첫번째 발생 시작 문자 위치를 가리키는 정수를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 예를 들어 CHAR.RINDEX(var1, 'abcd')는 변수 var1에서 전체 문자 "abcd"의 마지막 발생에 대한 시작 위치를 반환하고 CHAR.RINDEX(var1, 'abcd', 1)는 문자에서 값의 마지막 발생 위치 값을 반환하며 CHAR.RINDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 마지막 발생의 시작 위치 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle을 찾을 수 없는 경우 값 0이 반환됩니다.
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor]) 숫자. haystack이라는 문자에서 문자 needle의 첫번째 발생 시작 문자 위치를 가리키는 정수를 반환합니다. 선택적으로 사용하는 세 번째 인수 divisor는 needle을 별도 문자로 나누는 데 사용되는 문자 수입니다. 예를 들어 CHAR.RINDEX(var1, 'abcd')는 변수 var1에서 전체 문자 "abcd"의 마지막 발생에 대한 시작 위치를 반환하고 CHAR.RINDEX(var1, 'abcd', 1)는 문자에서 값의 마지막 발생 위치 값을 반환하며 CHAR.RINDEX(var1, 'abcd', 2)는 "ab" 또는 "cd"의 마지막 발생의 시작 위치 값을 반환합니다. Divisor는 양의 정수이어야 하며 needle 길이를 균일하게 나누어야 합니다. needle을 찾을 수 없는 경우 값 0이 반환됩니다.
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(문자표현식1,길이[,문자표현식2]) 문자열. 문자표현식2에 채우기 문자로 사용할 전체 복사본 수만큼 사용하여 길이에 의해 지정된 값으로 길이를 연장할 문자표현식2가 포함된 오른쪽 채우기 문자표현식1입니다. 길이 값은 문자 수를 나타내며 양의 정수이어야 합니다. 선택적인 세 번째 인수인 문자표현식2는 따옴표로 묶인 문자이거나 문자로 해석되는 표현식입니다. 문자표현식2가 생략된 경우 값은 공백으로 채워집니다.
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(문자표현식1,길이[,문자표현식2]) 문자열. 문자표현식2에 채우기 문자로 사용할 전체 복사본 수만큼 사용하여 길이에 의해 지정된 값으로 길이를 연장할 문자표현식2가 포함된 오른쪽 채우기 문자표현식1입니다. 길이 값은 문자 수를 나타내며 양의 정수이어야 합니다. 선택적인 세 번째 인수인 문자표현식2는 따옴표로 묶인 문자이거나 문자로 해석되는 표현식입니다. 문자표현식2가 생략된 경우 값은 공백으로 채워집니다.
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.RPAD(문자표현식,위치[,길이]) 문자열. 문자표현식의 문자 위치에서 시작하는 빼기를 반환합니다. 선택적인 세 번째 인수는 빼기에서 문자 수를 나타냅니다. 선택적인 인수 길이가 생략될 경우 문자표현식의 문자 위치에서 시작하고 문자표현식 끝까지 수행되는 빼기를 반환합니다. 예를 들어 CHAR.SUBSTR('abcd', 2)은 'bcd'를 반환하고 CHAR.SUBSTR('abcd', 2, 2)은 'bc'를 반환합니다.
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.RPAD(문자표현식,위치[,길이]) 문자열. 문자표현식의 문자 위치에서 시작하는 빼기를 반환합니다. 선택적인 세 번째 인수는 빼기에서 문자 수를 나타냅니다. 선택적인 인수 길이가 생략될 경우 문자표현식의 문자 위치에서 시작하고 문자표현식 끝까지 수행되는 빼기를 반환합니다. 예를 들어 CHAR.SUBSTR('abcd', 2)은 'bcd'를 반환하고 CHAR.SUBSTR('abcd', 2, 2)은 'bc'를 반환합니다.
concat16=16@Concat@CONCAT(?,?)@CONCAT(문자표현식,문자표현식[,...]) 문자열. 모든 인수를 연결한 문자를 반환하며, 이 값은 문자이어야 합니다. 이 함수는 둘 이상의 인수를 사용합니다. 코드 페이지 모드에서 문자표현식이 문자변수이고 정의된 변수 자리수로 오른쪽 채우기 없이 실제 문자 값만 원하는 경우 RTRIM을 사용합니다. 예를 들어 CONCAT(RTRIM(stringvar1), RTRIM(stringvar2))입니다.
cos1=1@Cos@COS(?)@COS(라디안) 숫자. 라디안 값의 코사인을 반환하며 라디안으로 측정된 숫자 값이어야 합니다.
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(시간값) 숫자. 시간값에서 분수 일을 포함하여 일 수를 반환하며 초 수, 시간 표현식 또는 시간 형식 변수입니다.
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(시간값) 숫자. 시간값에서 분수 시를 포함하여 시간 수를 반환하며 초 수, 시간 표현식 또는 시간 형식 변수입니다.
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(시간값) 숫자. 시간값에서 분수 분을 포함하여 분 수를 반환하며 초 수, 시간 표현식 또는 시간 형식 변수입니다.
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(시간값) 숫자. 시간값에서 분수 초를 포함하여 시간 수를 반환하며 숫자, 시간 표현식 또는 시간 형식 변수입니다.
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(일,월,년) 숫자. 일, 월, 년에 해당하는 날짜 값을 반환합니다. 인수는 정수이어야 하며 일은 1-31 사이, 월은 1-13 사이 및 년도는 1582보다 큰 4자리 정수입니다. 결과를 날짜로 표시하려면 날짜 형식을 결과 변수에 할당합니다.
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(월,일,년) 숫자. 일, 월, 년에 해당하는 날짜 값을 반환합니다. 인수는 정수이어야 하며 일은 1-31 사이, 월은 1-13 사이 및 년도는 1582보다 큰 4자리 정수입니다. 결과를 날짜로 표시하려면 날짜 형식을 결과 변수에 할당합니다.
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(월,년) 숫자. 월, 년에 해당하는 날짜 값을 반환합니다. 인수는 정수이어야 하며 월은 1-13 사이 및 년도는 1582보다 큰 4자리 정수입니다. 결과를 날짜로 표시하려면 날짜 형식을 결과 변수에 할당합니다.
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(4분기,년) 숫자. 4분기, 년에 해당하는 날짜 값을 반환합니다. 인수는 정수이어야 하며 4분기는 1-4 사이 및 년도는 1582보다 큰 4자리 정수입니다. 결과를 날짜로 표시하려면 날짜 형식을 결과 변수에 할당합니다.
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(주수,년) 숫자. 주수, 년에 해당하는 날짜 값을 반환합니다. 인수는 정수여야 하며 주수는 1에서 53 사이 및 연도는 1582보다 큰 4자리 정수입니다. 반환된 날짜 값은 해당 연도에 지정한 주의 첫째 날을 나타냅니다. 첫 주는 각 연도의 1월 1일에서 시작하므로 주어진 주 값의 반환된 날짜는 연도마다 다릅니다.결과를 날짜로 표시하려면 날짜 형식을 결과 변수에 지정합니다.
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(년,일수) 숫자. 년, 일수에 해당하는 날짜 값을 반환합니다. 인수는 정수이어야 하며 일수는 1-366 사이 및 년도는 1582보다 큰 4자리 정수입니다. 결과를 날짜로 표시하려면 날짜 형식을 결과 변수에 할당합니다.
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(datetime2, datetime1, "unit") 숫자. 두 날짜/시간 값의 차이를 계산하여 지정된 날짜/시간 단위의 정수(소수는 잘림)를 반환합니다. 여기서 datetime2와 datetime1은 모두 날짜 또는 시간 형식 변수(또는 유효한 날짜/시간 값을 나타내는 숫자값)이며 “unit”은 년, 4분기, 월, 주, 일, 시, 분, 초와 같은 문자열 리터럴 값 중 하나로서 따옴표로 묶여 표시됩니다.
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(datetime, value, "unit", "method") 숫자. 주어진 날짜 또는 시간 값을 사용하여 지정된 단위의 날짜 또는 시간 값을 계산합니다. 여기서 datetime은 날짜 또는 시간 형식 변수(또는 유효한 날짜/시간 값을 나타내는 숫자값)이며 “unit”은 년, 4분기, 월, 주, 일, 시, 분, 초와 같은 문자열 리터럴 값 중 하나로서 따옴표로 묶여 표시됩니다. 역시 따옴표로 묶여 표시되는 선택적 방법으로는 “롤오버” 또는 “최근접”을 사용할 수 있습니다. 롤오버 방법은 여분의 날을 다음 달로 넘깁니다. 디폴트 설정인 최근접 방법은 해당 달에서 가장 근접한 유효 날짜를 사용합니다. 반환된 값은 초 수로 표현된 날짜/시간 값입니다. 값을 날짜/시간으로 표시하려면 해당 변수에 적합한 형식을 지정합니다.
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(datetime, value, "unit", "method") 숫자. 주어진 날짜 또는 시간 값을 사용하여 지정된 단위의 날짜 또는 시간 값을 계산합니다. 여기서 datetime은 날짜 또는 시간 형식 변수(또는 유효한 날짜/시간 값을 나타내는 숫자값)이며 “unit”은 년, 4분기, 월, 주, 일, 시, 분, 초와 같은 문자열 리터럴 값 중 하나로서 따옴표로 묶여 표시됩니다. 역시 따옴표로 묶여 표시되는 선택적 방법으로는 “롤오버” 또는 “최근접”을 사용할 수 있습니다. 롤오버 방법은 여분의 날을 다음 달로 넘깁니다. 디폴트 설정인 최근접 방법은 해당 달에서 가장 근접한 유효 날짜를 사용합니다. 반환된 값은 초 수로 표현된 날짜/시간 값입니다. 값을 날짜/시간으로 표시하려면 해당 변수에 적합한 형식을 지정합니다.
exp1=1@Exp@EXP(?)@EXP(숫자표현식) 숫자. 숫자표현식의 e승을 반환합니다. e는 자연로그의 밑이며 숫자표현식은 숫자입니다. 숫자표현식에 큰 값을 사용하면 시스템 공간을 초과하는 결과가 나올 수 있습니다.
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(확률, 형태1, 형태2) 숫자. 지정한 형태 모수를 사용하여 누적 확률이 확률 모수가 되는 베타 분포의 값을 반환합니다.
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(확률, 위치, 척도) 숫자. 지정한 위치와 척도 모수를 사용하여 누적 확률이 확률 모수가 되는 Cauchy 분포의 값을 반환합니다.
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(확률, 자유도) 숫자. 지정한 자유도 df를 사용하여 누적 확률이 확률 모수가 되는 카이제곱 분포의 값을 반환합니다. 예를 들어 유의수준이 0.05이고 자유도가 3인 카이제곱 값은 IDF.CHISQ(0.95,3)이 됩니다.
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, 척도) 숫자. 척도 감소 비율을 사용하여 누적 확률이 확률 모수가 되는 지수형으로 감소하는 변수 값을 반환합니다.
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(확률, 자유도1, 자유도2) 숫자. 지정한 자유도를 사용하여 누적 확률이 확률 모수가 되는 F 분포의 값을 반환합니다. 예를 들어 유의수준이 0.05이고 자유도가 3인 F 값은 IDF.F(0.95,3,100)이 됩니다.
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(확률, 형태, 척도) 숫자. 지정한 형태와 척도 모수를 사용하여 누적 확률이 확률 모수가 되는 감마 분포의 값을 반환합니다.
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(확률, 평균, 표준편차) 숫자. 지정한 평균과 표준편차를 사용하여 누적 확률이 확률 모수가 되는 반정규분포의 값을 반환합니다.
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(확률, 위치, 척도) 숫자. 지정한 위치와 척도 모수를 사용하여 누적 확률이 확률 모수가 되는 역 Gaussian 분포의 값을 반환합니다.
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(확률, 평균, 척도) 숫자. 지정한 평균과 척도 모수를 사용하여 누적 확률이 확률 모수가 되는 라플라스 분포의 값을 반환합니다.
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(확률, a, b) 숫자. 지정한 모수를 사용하여 누적 확률이 확률 모수가 되는 로그-정규분포의 값을 반환합니다.
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(확률, 평균, 척도) 숫자. 지정한 평균과 척도 모수를 사용하여 누적 확률이 확률 모수가 되는 로지스틱 분포의 값을 반환합니다.
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(확률, 평균, 표준편차) 숫자. 지정한 평균과 표준편차를 사용하여 누적 확률이 확률 모수가 되는 정규분포의 값을 반환합니다.
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(확률, 한계치, 형태) 숫자. 지정한 한계치와 척도 모수를 사용하여 누적 확률이 확률 모수가 되는 파레토 분포의 값을 반환합니다.
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(확률, a, b) 숫자. 지정한 모수를 사용하여 누적 확률이 확률 모수가 되는 스튜던트화 최대 계수의 값을 반환합니다.
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(확률, a, b) 숫자. 지정한 모수를 사용하여 누적 확률이 확률 모수가 되는 스튜던트화 범위 통계량의 값을 반환합니다.
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(확률, 자유도) 숫자. 지정한 자유도 df를 사용하여 누적 확률이 확률 모수가 되는 스튜던트 t 분포의 값을 반환합니다.
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(확률, 최소값, 최대값) 숫자. 누적 확률이 확률 모수가 되는 최소값과 최대값 간 균일 분포의 값을 반환합니다.
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(확률, a, b) 숫자. 지정한 모수를 사용하여 누적 확률이 확률 모수가 되는 Weibull 분포의 값을 반환합니다.
lag(1)9=9@Lag(1)@LAG(?)@LAG(변수[, n]) 숫자 또는 문자 형식. 이전 케이스 또는 이전 n 케이스의 변수 값입니다. 선택적 두 번째 인수인 n은 양의 정수이어야 합니다. 기본값은 1입니다. 예를 들어 prev4=LAG(gnp,4)는 현재 케이스 이전의 네 번째 케이스에 대한 gnp 값을 반환합니다. 처음 네 개의 케이스에는 prev4에 대한 시스템 결측값이 포함되어 있습니다.
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(변수[, n]) 숫자 또는 문자 형식. 이전 케이스 또는 이전 n 케이스의 변수 값입니다. 선택적 두 번째 인수인 n은 양의 정수이어야 합니다. 기본값은 1입니다. 예를 들어 prev4=LAG(gnp,4)는 현재 케이스 이전의 네 번째 케이스에 대한 gnp 값을 반환합니다. 처음 네 개의 케이스에는 prev4에 대한 시스템 결측값이 포함되어 있습니다.
length16=16@Length@LENGTH(?)@LENGTH(문자표현식) 숫자. 문자표현식 길이를 바이트로 반환하는 문자 표현식이어야 합니다. 문자변수의 경우 이 값은 Unicode 모드에서 뒤에 오는 공백을 제외하고 각 값에서 바이트의 수이며 코드 페이지 모드에서는 뒤에 오는 공백을 포함하여 정의된 변수 길이입니다. 코드 페이지 모드에서 뒤에 오는 공백이 없도록 길이(바이트)를 정의하려면 LENGTH(RTRIM(문자표현식))을 사용하십시오.
lg101=1@Lg10@LG10(?)@LG10(숫자표현식) 숫자. 숫자표현식의 상용로그를 반환하며 0보다 큰 숫자이어야 합니다.
ln1=1@Ln@LN(?)@LN(숫자표현식) 숫자. 숫자표현식의 자연로그를 반환하며 0보다 큰 숫자이어야 합니다.
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(숫자표현식) 숫자. 숫자표현식의 완전 감마 함수 로그를 반환하며 0보다 큰 숫자이어야 합니다.
lower16=16@Lower@LOWER(?)@LOWER(문자표현식) 문자열. 대문자만 소문자로 바뀌고 다른 문자는 그대로인 문자표현식을 반환합니다. 인수는 문자변수 또는 값일 수 있습니다. 예를 들어 LOWER(name1)는 name1의 값이 Charles인 경우 charles를 반환합니다.
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(문자표현식[,문자]) 문자열. 문자 앞의 인스턴스가 제거된 문자표현식을 반환합니다. 문자를 지정하지 않을 경우 앞에 오는 공백이 제거됩니다. 문자는 단일 문자이어야 합니다.
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(문자표현식[,문자]) 문자열. 문자 앞의 인스턴스가 제거된 문자표현식을 반환합니다. 문자를 지정하지 않을 경우 앞에 오는 공백이 제거됩니다. 문자는 단일 문자이어야 합니다.
max13=13@Max@MAX(?,?)@MAX(값,값[,..]) 숫자 또는 문자 형식. 유효값을 가진 인수의 최대값을 반환합니다. 이 함수는 둘 이상의 인수를 사용합니다. 숫자 값의 경우 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
max15=15@Max@MAX(?,?)@MAX(값,값[,..]) 숫자 또는 문자 형식. 유효값을 가진 인수의 최대값을 반환합니다. 이 함수는 둘 이상의 인수를 사용합니다. 숫자 값의 경우 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(문자표현식,위치) 숫자. 문자표현식의 바이트 위치에서 문자로 바이트 수를 반환합니다.
mean15=15@Mean@MEAN(?,?)@MEAN(숫자표현식,숫자표현식[,..]) 숫자. 유효한 비결측값을 가진 인수의 산술 평균을 반환합니다. 이 함수는 둘 이상의 인수를 사용하며 모두 숫자이어야 합니다. 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
median15=15@Median@Median(?,?)@MEDIAN(숫자표현식,숫자표현식[,..]) 숫자. 유효한 비결측값을 가진 인수의 중위수(50 백분위수)를 반환합니다. 이 함수는 둘 이상의 인수를 사용하며 모두 숫자이어야 합니다. 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
min13=13@Min@MIN(?,?)@MIN(값,값[,..]) 숫자 또는 문자 형식. 유효한 결측값을 가진 인수의 최소값을 반환합니다. 이 함수는 둘 이상의 인수를 사용합니다. 숫자 값의 경우 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
min15=15@Min@MIN(?,?)@MIN(값,값[,..]) 숫자 또는 문자 형식. 유효한 결측값을 가진 인수의 최소값을 반환합니다. 이 함수는 둘 이상의 인수를 사용합니다. 숫자 값의 경우 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
missing10=10@Missing@MISSING(?)@MISSING(변수) 논리 형식. 사용자-결측값 또는 시스템 결측값이 있는 변수일 경우 1 또는 True를 반환합니다. 인수는 활성 데이터 파일에 있는 변수 이름이어야 합니다.
mod1=1@Mod@MOD(?,?)@MOD(숫자표현식,modulus) 숫자. 숫자표현식을 modulus로 나눌 때 나머지를 반환합니다. 두 인수는 숫자이어야 하며 modulus는 0이 아니어야 합니다.
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(양, 형태1, 형태2, 비중심) 숫자. 형태 및 비중심 모수를 사용하여 비중심화 베타 분포의 값이 양보다 작을 누적 확률을 반환합니다.
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(양, 자유도, 비중심) 숫자. 자유도와 비중심 모수를 사용하여 비중심화 카이제곱 분포의 값이 양보다 작을 누적 확률을 반환합니다.
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(양, 자유도1, 자유도2, 비중심) 숫자. 자유도1, 자유도2, 비중심을 사용하여 비중심화 F 분포의 값이 양보다 작을 누적 확률을 반환합니다.
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(양, 자유도, 비중심) 숫자. 지정한 자유도와 비중심 모수를 사용하여 비중심화 스튜던트 t 분포의 값이 양보다 작을 누적 확률을 반환합니다.
nmiss10=10@Nmiss@NMISS(?)@NMISS(변수[,..]) 숫자. 시스템 결측값 및 사용자-결측값이 있는 인수의 빈도를 반환합니다. 이 함수는 하나 이상의 인수를 사용하며 인수는 활성 데이터 파일에 있는 변수 이름이어야 합니다.
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(문자표현식) 문자열. 정규화된 버전의 문자표현식을 반환합니다. Unicode 모드에서 Unicode NFC를 반환합니다. 코드 페이지 모드에서는 영향이 없고 수정되지 않은 문자표현식을 반환합니다. 결과 길이는 입력 길이와 다를 수 있습니다.
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NCDF.BETA(양, 형태1, 형태2, 비중심) 숫자. 지정한 형태와 비중심 모수를 사용하여 양에서 비중심화 베타 분포의 확률 밀도를 반환합니다.
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(양, 자유도, 비중심) 숫자. 자유도와 지정한 비중심 모수를 사용하여 양에서 비중심 카이제곱 분포의 확률 밀도를 반환합니다.
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(양, 자유도1, 자유도2, 비중심) 숫자. 자유도1과 자유도2 및 비중심을 사용하여 양에서 비중심 F 분포의 확률 밀도를 반환합니다.
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(양, 자유도, 비중심) 숫자. 지정한 자유도와 비중심 모수를 사용하여 양에서 비중심 스튜던트의 t 분포의 확률 밀도를 반환합니다.
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(varname) 뒤에 오는 공백을 제거하지 않고 변수 이름 값을 반환합니다. 변수 이름 값은 변수 이름이어야 하며 표현식일 수 없습니다.
number3=3@Number@NUMBER(?,?)@NUMBER(문자표현식,포맷) 숫자. 문자표현식의 값을 숫자로 반환합니다. 두 번째 인수인 포맷은 문자표현식을 읽는 데 사용할 숫자 형식입니다. 예를 들어 NUMBER(stringDate,DATE11)는 일반적인 날짜 형식(dd-mmm-yyyy)이 포함된 문자를 두 번째 인수의 숫자로 변환하여 해당 날짜를 나타냅니다. (값을 날짜로 표시하려면 FORMATS 또는 FORMATS 명령을 사용합니다.) 이러한 형식으로 문자를 읽을 수 없을 때는 시스템 결측값을 반환합니다.
nvalid10=10@Nvalid@NVALID(?)@NVALID(변수[,..]) 숫자. 결측되지 않은 유효한 값이 있는 인수의 개수를 반환합니다. 이 함수는 하나 이상의 인수를 사용하며 인수는 활성 데이터 파일에 있는 변수 이름이어야 합니다.
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(양, 확률) 숫자. 지정된 확률 모수를 사용하여 Bernoulli 분포의 값이 양과 같은 확률을 반환합니다.
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(양, 형태1, 형태2) 숫자. 지정한 형태 모수를 사용하여 양에서 베타 분포의 확률 밀도를 반환합니다.
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(양, n, 확률) 숫자. 각각에서 성공 확률을 모수로 사용하여 n회의 시도에서 성공한 수가 양과 같은 확률을 반환합니다. n이 1이면 이 값은 PDF.BERNOULLI와 같습니다.
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(양1, 양2, 상관) 숫자. 지정한 상관 모수를 사용하여 양1, 양2에서 표준 이변량 정규분포의 확률 밀도를 반환합니다.
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(양, 위치, 척도) 숫자. 지정한 위치 및 척도 모수를 사용하여 양에서 Cauchy 분포의 확률 밀도를 반환합니다.
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(양, 자유도) 숫자. 자유도를 사용하여 양에서 카이제곱 분포의 확률 밀도를 반환합니다.
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(양, 형태) 숫자. 지정한 형태 모수를 사용하여 양에서 지수 분포의 확률 밀도를 반환합니다.
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(양, 자유도1, 자유도2) 숫자. 자유도1과 자유도2를 사용하여 양에서 F 분포의 확률 밀도를 반환합니다.
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(양, 형태, 척도) 숫자. 지정한 형태와 척도 모수를 사용하여 양에서 감마 분포의 확률 밀도를 반환합니다.
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(양, 확률) 숫자. 성공할 확률이 확률 모수에 의해 구해지는 경우 성공하기 위해 시도한 수가 양과 같은 확률을 반환합니다.
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(양, 평균, 표준편차) 숫자. 지정한 평균과 표준편차를 사용하여 양에서 반정규분포의 확률 밀도를 반환합니다.
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(양, 전체수, 실패수, 추출수) 숫자. hits가 지정한 특성을 갖는 크기 total로부터 표본 개체를 임의로 선택할 때 지정한 특성을 갖는 개체 수가 양보다 작거나 같은 확률을 반환합니다.
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(양, 위치, 척도) 숫자. 지정한 위치와 척도 모수를 사용하여 양에서 역 Gaussian 분포의 확률 밀도를 반환합니다.
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(양, 평균, 척도) 숫자. 지정한 평균과 척도 모수를 사용하여 양에서 라플라스 분포의 확률 밀도를 반환합니다.
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(양, a, b) 숫자. 지정한 모수를 사용하여 양에서 로그-정규분포의 확률 밀도를 반환합니다.
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(양, 평균, 척도) 숫자. 지정한 평균과 척도 모수를 사용하여 양에서 로지스틱 분포의 확률 밀도를 반환합니다.
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(양, 한계치, 확률) 숫자. 한계치에 대한 모수가 한계치이고 성공할 확률이 확률 모수에 의해 얻어질 때 성공을 시도한 수가 양과 같은 확률을 반환합니다.
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(양, 평균, 표준편차) 숫자. 지정한 평균과 표준편차를 사용하여 양에서 정규분포의 확률 밀도를 반환합니다.
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(양, 한계치, 형태) 숫자. 지정한 한계치와 형태 모수를 사용하여 양에서 파레토 분포의 확률 밀도를 반환합니다.
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(양, 평균) 숫자. 지정한 평균 또는 비율 모수를 사용하여 포아송 분포의 값이 양과 같은 확률을 반환합니다.
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(양, 자유도) 숫자. 지정한 자유도를 사용하여 양에서 스튜던트 t 분포의 확률 밀도를 반환합니다.
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(양, 최소값, 최대값) 숫자. 지정한 최소값과 최대값을 사용하여 양에서 균일분포의 확률 밀도를 반환합니다.
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(양, a, b) 숫자. 지정한 모수를 사용하여 양에서 Weibull 분포의 확률 밀도를 반환합니다.
range13=13@Range@RANGE(?,?,?)@RANGE(test,lo,hi[,lo,hi,..]) 논리 형식. o, hi 쌍으로 정의한 포함 범위 내에 검정이 있으면 1 또는 True를 반환합니다. 인수는 모두 숫자거나 같은 길이의 문자이어야 하고 각 lo, hi 쌍은 lo <= hi에 맞게 정렬되어야 합니다. 참고: 문자값의 경우 국가별로 서로 다른 정렬 순서를 사용하기 때문에 동일한 문자군일지라도 로케일에 따라 결과가 다를 수 있습니다. ASCII 순서가 아닌 언어 순서에 따라 특정 문자의 순서가 결정됩니다.
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]) 문자열. a1에 있는 a2의 인스턴스를 a3으로 바꿉니다. 선택적인 인수인 a4에는 바뀔 발생 수가 지정되는데 a4가 생략되면 모든 발생을 바꿉니다. a1, a2, a3 인수는 문자열 값(따옴표로 묶인 리터럴 문자나 문자변수)으로 해석되어야 하며 선택적인 인수 a4는 0또는 양의 정수로 해석되어야 합니다. 예를 들어 REPLACE("abcabc", "a", "x")는 "xbcxbc"의 값을 반환하고 REPLACE("abcabc", "a", "x", 1)는 "xbcabc"의 값을 반환합니다.
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]) 문자열. a1에 있는 a2의 인스턴스를 a3으로 바꿉니다. 선택적인 인수인 a4에는 바뀔 발생 수가 지정되는데 a4가 생략되면 모든 발생을 바꿉니다. a1, a2, a3 인수는 문자열 값(따옴표로 묶인 리터럴 문자나 문자변수)으로 해석되어야 하며 선택적인 인수 a4는 0또는 양의 정수로 해석되어야 합니다. 예를 들어 REPLACE("abcabc", "a", "x")는 "xbcxbc"의 값을 반환하고 REPLACE("abcabc", "a", "x", 1)는 "xbcabc"의 값을 반환합니다.
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]) 문자열. a1에 있는 a2의 인스턴스를 a3으로 바꿉니다. 선택적인 인수인 a4에는 바뀔 발생 수가 지정되는데 a4가 생략되면 모든 발생을 바꿉니다. a1, a2, a3 인수는 문자열 값(따옴표로 묶인 리터럴 문자나 문자변수)으로 해석되어야 하며 선택적인 인수 a4는 0또는 양의 정수로 해석되어야 합니다. 예를 들어 REPLACE("abcabc", "a", "x")는 "xbcxbc"의 값을 반환하고 REPLACE("abcabc", "a", "x", 1)는 "xbcabc"의 값을 반환합니다.
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]) 문자열. a1에 있는 a2의 인스턴스를 a3으로 바꿉니다. 선택적인 인수인 a4에는 바뀔 발생 수가 지정되는데 a4가 생략되면 모든 발생을 바꿉니다. a1, a2, a3 인수는 문자열 값(따옴표로 묶인 리터럴 문자나 문자변수)으로 해석되어야 하며 선택적인 인수 a4는 0또는 양의 정수로 해석되어야 합니다. 예를 들어 REPLACE("abcabc", "a", "x")는 "xbcxbc"의 값을 반환하고 REPLACE("abcabc", "a", "x", 1)는 "xbcabc"의 값을 반환합니다.
rnd(1)1=1@Rnd(1)@RND(?)@RND(숫자표현식[,mult,fuzzbits]) 숫자. 단일 인수로 해당 인수에 가장 가까운 정수를 반환합니다. .5로 끝나는 수는 정확히 0으로부터 반올림합니다. 예를 들어 RND(-4.5)는 -5로 반올림됩니다. 선택적 두 번째 인수인 mult는 결과가 이 값의 정수 곱입니다. 예를 들면 RND(-4.57,0.1) = -4.6입니다. 값은 숫자이어야 하지만 0일 수 없습니다. 기본값은 1입니다. 선택적 세 번째 인수인 fuzzbits는 숫자표현식이 반올림할 한계치에 못미칠 수 있지만(예를 들어 정수로 반올림하는 경우 0.5) 계속 반올림할 수 있는 최소유의 비트 수입니다. 생략된 경우 FUZZBITS의 시스템 설정(설치 시 6으로 설정)이 사용됩니다.
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(숫자표현식[,mult,fuzzbits]) 숫자. 단일 인수로 해당 인수에 가장 가까운 정수를 반환합니다. .5로 끝나는 수는 정확히 0으로부터 반올림합니다. 예를 들어 RND(-4.5)는 -5로 반올림됩니다. 선택적 두 번째 인수인 mult는 결과가 이 값의 정수 곱입니다. 예를 들면 RND(-4.57,0.1) = -4.6입니다. 값은 숫자이어야 하지만 0일 수 없습니다. 기본값은 1입니다. 선택적 세 번째 인수인 fuzzbits는 숫자표현식이 반올림할 한계치에 못미칠 수 있지만(예를 들어 정수로 반올림하는 경우 0.5) 계속 반올림할 수 있는 최소유의 비트 수입니다. 생략된 경우 FUZZBITS의 시스템 설정(설치 시 6으로 설정)이 사용됩니다.
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(숫자표현식[,mult,fuzzbits]) 숫자. 단일 인수로 해당 인수에 가장 가까운 정수를 반환합니다. .5로 끝나는 수는 정확히 0으로부터 반올림합니다. 예를 들어 RND(-4.5)는 -5로 반올림됩니다. 선택적 두 번째 인수인 mult는 결과가 이 값의 정수 곱입니다. 예를 들면 RND(-4.57,0.1) = -4.6입니다. 값은 숫자이어야 하지만 0일 수 없습니다. 기본값은 1입니다. 선택적 세 번째 인수인 fuzzbits는 숫자표현식이 반올림할 한계치에 못미칠 수 있지만(예를 들어 정수로 반올림하는 경우 0.5) 계속 반올림할 수 있는 최소유의 비트 수입니다. 생략된 경우 FUZZBITS의 시스템 설정(설치 시 6으로 설정)이 사용됩니다.
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(문자표현식[,문자]) 문자열. 문자표현식 내에서 뒤에 오는 문자 인스턴스를 자릅니다. 선택적으로 사용할 수 있는 두 번째 인수 문자는 단일 따옴표로 묶인 글자이거나 단일 문자를 나타내는 문자 표현식입니다. 문자가 생략되면 뒤에 오는 공백이 잘립니다.
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(문자표현식[,문자]) 문자열. 문자표현식 내에서 뒤에 오는 문자 인스턴스를 자릅니다. 선택적으로 사용할 수 있는 두 번째 인수 문자는 단일 따옴표로 묶인 글자이거나 단일 문자를 나타내는 문자 표현식입니다. 문자가 생략되면 뒤에 오는 공백이 잘립니다.
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(확률) 숫자. 지정한 확률 모수를 사용하여 Bernoulli 분포의 확률 값을 반환합니다.
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(형태1, 형태2) 숫자. 지정한 형태 모수를 사용하여 베타 분포의 확률 값을 반환합니다.
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, 확률) 숫자. 지정한 시도 횟수와 확률 모수를 사용하여 이항 분포의 확률 값을 반환합니다.
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(위치, 척도) 숫자. 지정한 위치과 척도 모수를 사용하여 Cauchy 분포의 확률 값을 반환합니다.
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(자유도) 숫자. 지정한 자유도를 사용하여 카이제곱 분포의 확률 값을 반환합니다.
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.GAMMA(형태) 숫자. 지정한 척도 모수를 사용하여 지수 분포의 확률 값을 반환합니다.
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(자유도1, 자유도2) 숫자. 지정한 자유도1과 자유도2를 사용하여 F 분포의 확률 값을 반환합니다.
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(형태, 척도) 숫자. 지정한 형태와 척도 모수를 사용하여 감마 분포의 확률 값을 반환합니다.
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(확률) 숫자. 지정한 확률 모수를 사용하여 기하 분포의 확률 값을 반환합니다.
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.NORMAL(평균, 표준편차) 숫자. 지정한 평균과 표준편차를 사용하여 반정규분포의 확률 값을 반환합니다.
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(전체수, 실패수, 추출수) 숫자. 지정한 모수를 사용하여 복합기하 분포의 확률 값을 반환합니다.
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(위치, 척도) 숫자. 지정한 위치와 척도 모수를 사용하여 역 Gaussian 분포의 확률 값을 반환합니다.
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(평균, 척도) 숫자. 지정한 평균과 척도 모수를 사용하여 라플라스 분포의 확률 값을 반환합니다.
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b) 숫자. 지정한 모수를 사용하여 로그-정규분포의 확률 값을 반환합니다.
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(평균, 척도) 숫자. 지정한 평균과 척도 모수를 사용하여 로지스틱 분포의 확률 값을 반환합니다.
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(한계치, 확률) 숫자. 지정한 한계치와 확률 모수를 사용하여 음의 이항 분포의 확률 값을 반환합니다.
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(평균, 표준편차) 숫자. 지정한 평균과 표준편차를 사용하여 정규분포의 확률 값을 반환합니다.
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(한계치, 형태) 숫자. 지정한 한계치와 형태 모수를 사용하여 파레토 분포의 확률 값을 반환합니다.
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(평균) 숫자. 지정한 평균/비율 모수를 사용하여 포아송 분포의 확률 값을 반환합니다.
rv.t12=12@Rv.T@RV.T(?)@RV.T(자유도) 숫자. 지정한 자유도를 사용하여 스튜던트 t 분포의 확률 값을 반환합니다.
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(최소, 최대) 숫자. 지정한 최소값과 최대값을 사용하여 균일 분포의 확률 값을 반환합니다. UNIFORM 함수도 참조합니다.
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b) 숫자. 지정된 확률 모수를 사용하여 Weibull 분포의 확률 값을 반환합니다.
sd15=15@Sd@SD(?,?)@SD(숫자표현식,숫자표현식[,..]) 숫자. 유효한 비결측값을 가진 인수의 표준편차를 반환합니다. 이 함수는 둘 이상의 인수를 사용하며 모두 숫자이어야 합니다. 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(양,자유도) 숫자. 자유도를 사용하여 카이제곱 분포의 값이 양보다 큰 누적 확률을 반환합니다.
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(양, 자유도1, 자유도2) 숫자. 자유도 df1과 df2를 사용하여 F 분포의 값이 양보다 큰 누적 확률을 반환합니다.
sin1=1@Sin@SIN(?)@SIN(라디안) 숫자. 라디안 값의 사인을 반환하며 라디안으로 측정한 숫자 값이어야 합니다.
sqrt1=1@Sqrt@SQRT(?)@SQRT(숫자표현식) 숫자. 숫자표현식의 양의 제곱근을 반환하며 음이 아닌 숫자이어야 합니다.
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(핸들,"함수", 값) 문자열. 핸들이 지정하는 모형을 사용하여 특정 점수 함수를 입력 케이스 데이터에 적용하며, 여기서의 “function”은 predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance와 같은 문자열 리터럴 값 중 하나로 따옴표로 묶여 표시됩니다. 모드 핸들은 MODEL HANDLE 명령에서 정의된 것처럼 외부 XML 파일과 연결된 이름입니다. 세 개의 선택적 인수는 함수가 "probability", "neighbor" 또는 "distance"일 때 적용됩니다. "probability"는 확률이 계산되는 범주를 지정합니다. "neighbor" 및 "distance"는 가장 가까운 이웃 모형에 대한 특정 이웃(정수)을 지정합니다. 값이 계산될 수 없는 경우 StrApplyModel은 빈 문자열을 반환합니다.
string3=3@String@STRING(?,?)@STRING(숫자표현식,포맷) 문자열. 숫자표현식이 포멧에 따라 문자로 변환될 때 생성되는 문자를 반환합니다. STRING(-1.5,F5.2)은 문자 값 '-1.50'을 반환합니다. 두 번째 인수인 포멧은 숫자 값을 작성할 수 있는 형식이어야 합니다.
strunc16=16@Strunc@STRUNC(?,?)@STRUNC(문자표현식, 길이) 문자열. 길이(바이트)만큼 잘린 다음 뒤에 오는 공백을 자른 문자표현식을 반환합니다. 자르기는 잘릴 문자의 부분을 제거합니다.
sum15=15@Sum@SUM(?,?)@SUM(숫자표현식,숫자표현식[,..]) 숫자. 유효한 비결측값을 가진 인수의 합계를 반환합니다. 이 함수는 둘 이상의 인수를 사용하며 모두 숫자이어야 합니다. 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(숫자변수) 논리 형식. 숫자변수 값이 시스템 결측값일 경우 1 또는 참을 반환합니다. 숫자변수 인수는 활성 데이터 파일에 있는 숫자변수의 이름이어야 합니다.
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(일자) 숫자. 일 수에 해당하는 시간간격을 반환합니다. 인수는 숫자이어야 합니다. 결과를 시간으로 표시하려면 시간 형식을 결과 변수에 할당합니다.
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(시[,분,초]) 숫자. 시, 분 및 초로 표시된 숫자에 해당하는 시간 간격을 반환합니다. 분 및 초 인수는 옵션입니다. 분 및 초는 고차원 인수가 0이 아닌 경우 60 미만의 숫자이어야 합니다. 마지막 0이 아닌 인수를 제외하고 모든 인수는 정수이어야 합니다. 예를 들어 TIME.HMS(25.5) 및 TIME.HMS(0,90,25.5)는 유효하지만 TIME.HMS(25.5,30) 및 TIME.HMS(25,90)는 유효하지 않습니다. 모든 인수는 모두 양수 또는 음수 값이어야 합니다. 결과를 시간으로 표시하려면 시간 형식을 결과 변수에 할당합니다.
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(시[,분,초]) 숫자. 시, 분 및 초로 표시된 숫자에 해당하는 시간 간격을 반환합니다. 분 및 초 인수는 옵션입니다. 분 및 초는 고차원 인수가 0이 아닌 경우 60 미만의 숫자이어야 합니다. 마지막 0이 아닌 인수를 제외하고 모든 인수는 정수이어야 합니다. 예를 들어 TIME.HMS(25.5) 및 TIME.HMS(0,90,25.5)는 유효하지만 TIME.HMS(25.5,30) 및 TIME.HMS(25,90)는 유효하지 않습니다. 모든 인수는 모두 양수 또는 음수 값이어야 합니다. 결과를 시간으로 표시하려면 시간 형식을 결과 변수에 할당합니다.
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(시[,분,초]) 숫자. 시, 분 및 초로 표시된 숫자에 해당하는 시간 간격을 반환합니다. 분 및 초 인수는 옵션입니다. 분 및 초는 고차원 인수가 0이 아닌 경우 60 미만의 숫자이어야 합니다. 마지막 0이 아닌 인수를 제외하고 모든 인수는 정수이어야 합니다. 예를 들어 TIME.HMS(25.5) 및 TIME.HMS(0,90,25.5)는 유효하지만 TIME.HMS(25.5,30) 및 TIME.HMS(25,90)는 유효하지 않습니다. 모든 인수는 모두 양수 또는 음수 값이어야 합니다. 결과를 시간으로 표시하려면 시간 형식을 결과 변수에 할당합니다.
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(숫자표현식[,mult,fuzzbits]) 숫자. 잘린 숫자표현식 값을 0 방향으로 반환합니다. 선택적으로 사용할 수 있는 두 번째 인수인 mult는 결과가 이 값의 정수 곱입니다.—예를 들면 TRUNC(4.579,0.1) = 4.5입니다. 값은 숫자이어야 하지만 0일 수 없습니다. 기본값은 1입니다. 선택적 세 번째 인수인 fuzzbits는 숫자표현식이 가장 가까운 반올림할 경계에 못미칠 수 있으며 자르기 전에 반올림될 수 있습니다. 예를 들어 숫자표현식이 1.4 및 1.5 사이이고 mult가 0.1인 경우 fuzzbits는 숫자표현식이 1.5가 되고(가장 가까운 경계) 반올림될 수 있는 방법을 지정합니다. 생략된 경우 FUZZBITS의 시스템 설정(설치 시 6으로 설정)이 사용됩니다.
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(숫자표현식[,mult,fuzzbits]) 숫자. 잘린 숫자표현식 값을 0 방향으로 반환합니다. 선택적으로 사용할 수 있는 두 번째 인수인 mult는 결과가 이 값의 정수 곱입니다.—예를 들면 TRUNC(4.579,0.1) = 4.5입니다. 값은 숫자이어야 하지만 0일 수 없습니다. 기본값은 1입니다. 선택적 세 번째 인수인 fuzzbits는 숫자표현식이 가장 가까운 반올림할 경계에 못미칠 수 있으며 자르기 전에 반올림될 수 있습니다. 예를 들어 숫자표현식이 1.4 및 1.5 사이이고 mult가 0.1인 경우 fuzzbits는 숫자표현식이 1.5가 되고(가장 가까운 경계) 반올림될 수 있는 방법을 지정합니다. 생략된 경우 FUZZBITS의 시스템 설정(설치 시 6으로 설정)이 사용됩니다.
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(숫자표현식[,mult,fuzzbits]) 숫자. 잘린 숫자표현식 값을 0 방향으로 반환합니다. 선택적으로 사용할 수 있는 두 번째 인수인 mult는 결과가 이 값의 정수 곱입니다.—예를 들면 TRUNC(4.579,0.1) = 4.5입니다. 값은 숫자이어야 하지만 0일 수 없습니다. 기본값은 1입니다. 선택적 세 번째 인수인 fuzzbits는 숫자표현식이 가장 가까운 반올림할 경계에 못미칠 수 있으며 자르기 전에 반올림될 수 있습니다. 예를 들어 숫자표현식이 1.4 및 1.5 사이이고 mult가 0.1인 경우 fuzzbits는 숫자표현식이 1.5가 되고(가장 가까운 경계) 반올림될 수 있는 방법을 지정합니다. 생략된 경우 FUZZBITS의 시스템 설정(설치 시 6으로 설정)이 사용됩니다.
upcase16=16@Upcase@UPCASE(?)@UPCASE(문자표현식) 문자열. 대문자만 소문자로 바뀌고 다른 글자는 그대로인 문자표현식을 반환합니다.
value10=10@Value@VALUE(?)@VALUE(변수) 숫자 또는 문자 형식. 변수에 대한 사용자-결측값 정의를 무시하는 변수 값을 반환하는데 이 값은 변수 이름이거나 변수 이름에 대한 벡터 참조이어야 합니다.
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(varname) 문자열. 변수 값으로 값 설명을 반환하며 값 설명이 없는 경우엔 빈 문자를 반환합니다. 변수 이름 값은 변수 이름이어야 하며 표현식일 수 없습니다.
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(숫자표현식,숫자표현식[,..]) 숫자. 유효값을 가진 인수의 분산을 반환합니다. 이 함수는 둘 이상의 인수를 사용하며 모두 숫자이어야 합니다. 이 함수로 추정할 유효 인수의 최소 수를 지정할 수 있습니다.
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 날짜 부분을 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다. 결과를 날짜로 표시하려면 날짜 형식을 변수에 적용합니다.
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(datetime) 숫자. 시간 또는 datetime을 표시하는 값에서 시간(0-23 사이 정수)을 반환합니다. 인수는 숫자, 시간, datetime 변수 또는 시간 또는 datetime 값을 표시하는 표현식일 수 있습니다.
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 연도의 일(1-356 사이 정수)을 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다.
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 월의 일(1-31 사이 정수)을 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다.
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(datetime) 숫자. 시간 또는 datetime을 표시하는 값에서 분(0-59 사이 정수)을 반환합니다. 인수는 숫자, 시간, datetime 변수 또는 시간 또는 datetime 값을 표시하는 표현식일 수 있습니다.
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 월(1-12 사이 정수)을 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다.
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 연도의 분기(1-4 사이 정수)를 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다.
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(datetime) 숫자. 시간 또는 datetime을 표시하는 값에서 초(0-60 사이 정수)를 반환합니다. 인수는 숫자, 시간, datetime 변수 또는 시간 또는 datetime 값을 표시하는 표현식일 수 있습니다.
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(시간값) 숫자. 시간 간격을 표시하는 숫자 값에서 전체 일수(정수)를 반환합니다. 인수는 숫자, 시간 형식 변수 또는 시간 간격을 표시하는 표현식일 수 있습니다.
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(시간값) 숫자. 시간 간격을 표시하는 숫자 값에서 전체 일수(정수)를 반환합니다. 인수는 숫자, 시간 형식 변수 또는 시간 간격을 표시하는 표현식일 수 있습니다.
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(datetime) 숫자. 시간 또는 datetime을 표시하는 값에서 시간 부분을 반환합니다. 인수는 숫자, 시간, datetime 변수 또는 시간 또는 datetime 값을 표시하는 표현식일 수 있습니다. 결과를 시간으로 표시하려면 시간 형식을 변수에 적용합니다.
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 주 값(1-53 사이 정수)을 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다.
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 요일 값(1, 일요일 및 7, 토요일 사이 정수)을 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다.
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(날짜값) 숫자. 날짜를 표시하는 숫자 값에서 연도(4자리 정수)를 반환합니다. 인수는 숫자, 날짜 형식 변수 또는 날짜를 표시하는 표현식일 수 있습니다.
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(년,월,일) 숫자. 1582년 10월 15일부터 일 수를 년, 월, 일 인수를 나타내는 날짜로 반환하며 이러한 값은 1582년 10월 15일 이후부터 유효한 날짜를 나타내는 정수가 되어야 합니다. 두 자리 값인 년은 옵션 설정(편집메뉴에서 옵션의 데이터 탭)에 따라 세기로 간주합니다. 기본적으로 두 자리 값인 년의 범위는 현재 날짜 이전 69년부터 시작하여 현재 날짜 이후 30년까지 해당합니다.
